open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_lptim.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_lptim.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 ****************************************************************************/

/* ADR-028: Low-power timer (LPTIM1-5) lower-half driver.
 *
 * This delivers the timing function of ADR-028 via two NuttX frameworks:
 * LPTIM1-5 as plain periodic timers on the timer character framework
 * (/dev/timerN), and -- when CONFIG_STM32_LPTIM2_PWM is set -- LPTIM2 as a
 * low-power PWM output on the PWM framework (/dev/pwm0) driving LPTIM2_CH1.
 * Each LPTIM is a 16-bit counter clocked here from the LSI (~32 kHz) so it
 * keeps running from a low-power oscillator independent of the APB clock.
 *
 * PWM mode shares the LPTIM CR/CFGR with periodic mode, so a given instance
 * is exposed as either /dev/timerN or /dev/pwm0, never both; the Kconfig
 * choice enforces the mutual exclusion (LPTIM2_PWM depends on !LPTIM2).
 *
 * The remaining low-power differentiator -- keeping the counter running
 * through CPU Stop mode to wake the core -- is left as a separate ADR-028
 * sub-item.
 *
 * LPTIM differs from the general-purpose timers in its programming model:
 * CFGR and the interrupt-enable register must be written while the timer
 * is disabled; the auto-reload register must be written only after the
 * timer is enabled and each write must wait for the ISR.ARROK handshake;
 * and the periodic event is the auto-reload match (ARRM), not the TIM
 * update flag.  Because the counter clock (LSI) is asynchronous to the
 * APB read bus, the counter is read coherently (two matching reads).
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/timers/timer.h>
#include <nuttx/spinlock.h>

#ifdef CONFIG_STM32_LPTIM2_PWM
#  include <nuttx/timers/pwm.h>
#  include "stm32n6_gpio.h"
#endif

#include "arm_internal.h"
#include "chip.h"
#include "stm32n6_lptim.h"
#include "hardware/stm32_lptim.h"
#include "hardware/stm32_rcc.h"

#ifdef CONFIG_STM32_LPTIM_STOPWAKE
#  include <time.h>
#  include "stm32n6_pwr.h"
#  include "hardware/stm32_exti.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LSI nominal frequency (Hz).  The LPTIM tick equals one LSI period with
 * the prescaler left at divide-by-1, i.e. ~31.25 us.
 */

#define STM32N6_LPTIM_LSI_FREQ  32000

/* 16-bit counter: the largest reload is 0x10000 ticks, so the maximum
 * timeout is that many LSI periods expressed in microseconds.
 */

#define STM32N6_LPTIM_MAXTICKS  0x10000ull
#define STM32N6_LPTIM_MAXTIMEOUT \
  ((STM32N6_LPTIM_MAXTICKS * 1000000ull) / STM32N6_LPTIM_LSI_FREQ)

/* Bounded handshake budgets (microseconds).  LSI enable and the ARROK
 * handshake each take only a few slow-clock cycles; never spin forever.
 */

#define STM32N6_LPTIM_TIMEOUT_US  10000

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32n6_lptim_lowerhalf_s
{
  const struct timer_ops_s *ops;      /* Lower-half ops (must be 1st) */
  uint32_t                  base;     /* LPTIM register base address */
  int                       irq;      /* LPTIM global IRQ number */

  /* Per-instance clocking.  LPTIM1 sits on APB1; LPTIM2-5 sit on APB4, so
   * the enable / sleep-keep-alive registers and the CCIPR12 kernel-clock
   * select field differ per instance.  These make enableclk() data-driven.
   */

  uint32_t                  clken;    /* RCC bus clock-enable register */
  uint32_t                  clkbit;   /* Enable bit within clken */
  uint32_t                  lpen;     /* RCC sleep clock-enable register */
  uint32_t                  lpbit;    /* Keep-alive bit within lpen */
  uint32_t                  selmask;  /* CCIPR12 kernel-clock select mask */
  uint32_t                  sellsi;   /* CCIPR12 LSI select value */

  tccb_t                    callback; /* Upper-half timeout callback */
  void                     *arg;      /* Argument for the callback */
  uint32_t                  timeout;  /* Current timeout (microseconds) */
  bool                      started;  /* True when the timer is running */
};

#ifdef CONFIG_STM32_LPTIM2_PWM

/* LPTIM2 PWM-output lower-half.  PWM mode is mutually exclusive with the
 * plain periodic-timer mode (they share CR/CFGR), so a given LPTIM instance
 * is exposed either as /dev/timerN or as /dev/pwm0, never both.
 */

struct stm32n6_lptim_pwm_s
{
  const struct pwm_ops_s *ops;      /* Lower-half ops (must be 1st) */
  uint32_t                base;     /* LPTIM register base address */
  uint32_t                pin;      /* LPTIM_CH1 output pin config */

  uint32_t                clken;    /* RCC bus clock-enable register */
  uint32_t                clkbit;   /* Enable bit within clken */
  uint32_t                lpen;     /* RCC sleep clock-enable register */
  uint32_t                lpbit;    /* Keep-alive bit within lpen */
  uint32_t                selmask;  /* CCIPR12 kernel-clock select mask */
  uint32_t                sellsi;   /* CCIPR12 LSI select value */
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  stm32n6_lptim_start(struct timer_lowerhalf_s *lower);
static int  stm32n6_lptim_stop(struct timer_lowerhalf_s *lower);
static int  stm32n6_lptim_getstatus(struct timer_lowerhalf_s *lower,
                                     struct timer_status_s *status);
static int  stm32n6_lptim_settimeout(struct timer_lowerhalf_s *lower,
                                      uint32_t timeout);
static void stm32n6_lptim_setcallback(struct timer_lowerhalf_s *lower,
                                       tccb_t callback, void *arg);
static int  stm32n6_lptim_maxtimeout(struct timer_lowerhalf_s *lower,
                                      uint32_t *maxtimeout);

#ifdef CONFIG_STM32_LPTIM2_PWM
static int  stm32n6_lppwm_setup(struct pwm_lowerhalf_s *dev);
static int  stm32n6_lppwm_shutdown(struct pwm_lowerhalf_s *dev);
static int  stm32n6_lppwm_start(struct pwm_lowerhalf_s *dev,
                                const struct pwm_info_s *info);
static int  stm32n6_lppwm_stop(struct pwm_lowerhalf_s *dev);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct timer_ops_s g_stm32n6_lptim_ops =
{
  .start       = stm32n6_lptim_start,
  .stop        = stm32n6_lptim_stop,
  .getstatus   = stm32n6_lptim_getstatus,
  .settimeout  = stm32n6_lptim_settimeout,
  .setcallback = stm32n6_lptim_setcallback,
  .maxtimeout  = stm32n6_lptim_maxtimeout,
};

#ifdef CONFIG_STM32_LPTIM1
static struct stm32n6_lptim_lowerhalf_s g_lptim1_lowerhalf =
{
  .ops     = &g_stm32n6_lptim_ops,
  .base    = STM32_LPTIM1_BASE,
  .irq     = STM32_IRQ_LPTIM1,
  .clken   = STM32_RCC_APB1ENR1,
  .clkbit  = RCC_APB1ENR1_LPTIM1EN,
  .lpen    = STM32_RCC_APB1LPENR1,
  .lpbit   = RCC_APB1LPENR1_LPTIM1LPEN,
  .selmask = RCC_CCIPR12_LPTIM1SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM1SEL_LSI,
};
#endif

