open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_lptim.c
#ifdef CONFIG_STM32_LPTIM2
static struct stm32n6_lptim_lowerhalf_s g_lptim2_lowerhalf =
{
  .ops     = &g_stm32n6_lptim_ops,
  .base    = STM32_LPTIM2_BASE,
  .irq     = STM32_IRQ_LPTIM2,
  .clken   = STM32_RCC_APB4ENR1,
  .clkbit  = RCC_APB4ENR1_LPTIM2EN,
  .lpen    = STM32_RCC_APB4LPENR1,
  .lpbit   = RCC_APB4LPENR1_LPTIM2LPEN,
  .selmask = RCC_CCIPR12_LPTIM2SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM2SEL_LSI,
};
#endif

#ifdef CONFIG_STM32_LPTIM3
static struct stm32n6_lptim_lowerhalf_s g_lptim3_lowerhalf =
{
  .ops     = &g_stm32n6_lptim_ops,
  .base    = STM32_LPTIM3_BASE,
  .irq     = STM32_IRQ_LPTIM3,
  .clken   = STM32_RCC_APB4ENR1,
  .clkbit  = RCC_APB4ENR1_LPTIM3EN,
  .lpen    = STM32_RCC_APB4LPENR1,
  .lpbit   = RCC_APB4LPENR1_LPTIM3LPEN,
  .selmask = RCC_CCIPR12_LPTIM3SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM3SEL_LSI,
};
#endif

#ifdef CONFIG_STM32_LPTIM4
static struct stm32n6_lptim_lowerhalf_s g_lptim4_lowerhalf =
{
  .ops     = &g_stm32n6_lptim_ops,
  .base    = STM32_LPTIM4_BASE,
  .irq     = STM32_IRQ_LPTIM4,
  .clken   = STM32_RCC_APB4ENR1,
  .clkbit  = RCC_APB4ENR1_LPTIM4EN,
  .lpen    = STM32_RCC_APB4LPENR1,
  .lpbit   = RCC_APB4LPENR1_LPTIM4LPEN,
  .selmask = RCC_CCIPR12_LPTIM4SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM4SEL_LSI,
};
#endif

#ifdef CONFIG_STM32_LPTIM5
static struct stm32n6_lptim_lowerhalf_s g_lptim5_lowerhalf =
{
  .ops     = &g_stm32n6_lptim_ops,
  .base    = STM32_LPTIM5_BASE,
  .irq     = STM32_IRQ_LPTIM5,
  .clken   = STM32_RCC_APB4ENR1,
  .clkbit  = RCC_APB4ENR1_LPTIM5EN,
  .lpen    = STM32_RCC_APB4LPENR1,
  .lpbit   = RCC_APB4LPENR1_LPTIM5LPEN,
  .selmask = RCC_CCIPR12_LPTIM5SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM5SEL_LSI,
};
#endif

#ifdef CONFIG_STM32_LPTIM2_PWM
static const struct pwm_ops_s g_stm32n6_lppwm_ops =
{
  .setup    = stm32n6_lppwm_setup,
  .shutdown = stm32n6_lppwm_shutdown,
  .start    = stm32n6_lppwm_start,
  .stop     = stm32n6_lppwm_stop,
};

static struct stm32n6_lptim_pwm_s g_lptim2_pwm =
{
  .ops     = &g_stm32n6_lppwm_ops,
  .base    = STM32_LPTIM2_BASE,
  .pin     = GPIO_LPTIM2_CH1,
  .clken   = STM32_RCC_APB4ENR1,
  .clkbit  = RCC_APB4ENR1_LPTIM2EN,
  .lpen    = STM32_RCC_APB4LPENR1,
  .lpbit   = RCC_APB4LPENR1_LPTIM2LPEN,
  .selmask = RCC_CCIPR12_LPTIM2SEL_MASK,
  .sellsi  = RCC_CCIPR12_LPTIM2SEL_LSI,
};
#endif

static spinlock_t g_lptim_lock = SP_UNLOCKED;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_lptim_timeout_to_ticks
 *
 * Description:
 *   Convert a timeout in microseconds to LPTIM counter ticks (LSI periods).
 *   Returns the tick count, or 0 if the request is out of the valid
 *   [1, 0x10000] range.
 *
 ****************************************************************************/

static uint32_t stm32n6_lptim_timeout_to_ticks(uint32_t timeout)
{
  uint64_t ticks;

  ticks = ((uint64_t)timeout * STM32N6_LPTIM_LSI_FREQ) / 1000000ull;
  if (ticks == 0 || ticks > STM32N6_LPTIM_MAXTICKS)
    {
      return 0;
    }

  return (uint32_t)ticks;
}

/****************************************************************************
 * Name: stm32n6_lptim_readcnt
 *
 * Description:
 *   Read the LPTIM counter coherently.  The counter is clocked by the LSI,
 *   which is asynchronous to the APB read bus, so a single read can catch
 *   the register mid-carry; the reference manual requires reading until two
 *   consecutive reads agree.
 *
 ****************************************************************************/

static uint32_t stm32n6_lptim_readcnt(struct stm32n6_lptim_lowerhalf_s *priv)
{
  uint32_t v1;
  uint32_t v2;

  v1 = getreg32(priv->base + STM32_LPTIM_CNT_OFFSET);
  do
    {
      v2 = v1;
      v1 = getreg32(priv->base + STM32_LPTIM_CNT_OFFSET);
    }
  while (v1 != v2);

  return v1 & 0xffff;
}

/****************************************************************************
 * Name: stm32n6_lptim_enableclk
 *
 * Description:
 *   Bring up the LPTIM1 clocking: enable the LSI oscillator, route it to
 *   the LPTIM1 kernel-clock mux, open the APB1 peripheral gate and keep it
 *   alive across CPU Sleep (WFI).  Without the LPEN bit the clock gates
 *   while a task blocks and the periodic interrupt never wakes the core.
 *
 ****************************************************************************/

static int stm32n6_lptim_clk_bringup(uint32_t clken, uint32_t clkbit,
                                     uint32_t lpen, uint32_t lpbit,
                                     uint32_t selmask, uint32_t sellsi)
{
  irqstate_t flags;
  uint32_t regval;
  int i;
  int ret = -ETIMEDOUT;

  flags = spin_lock_irqsave(&g_lptim_lock);

  /* Enable LSI (write to the CSR set-alias) and wait for it to stabilize */

  putreg32(RCC_CR_LSION, STM32_RCC_CSR);

  for (i = 0; i < STM32N6_LPTIM_TIMEOUT_US; i++)
    {
      if ((getreg32(STM32_RCC_SR) & RCC_SR_LSIRDY) != 0)
        {
          ret = OK;
          break;
        }

      up_udelay(1);
    }

  if (ret < 0)
    {
      spin_unlock_irqrestore(&g_lptim_lock, flags);
      return ret;
    }

  /* Select LSI as this LPTIM's kernel clock (CCIPR12 carries all five) */

  regval  = getreg32(STM32_RCC_CCIPR12);
  regval &= ~selmask;
  regval |= sellsi;
  putreg32(regval, STM32_RCC_CCIPR12);

  /* Open the peripheral bus gate and its Sleep-mode keep-alive.  LPTIM1
   * lives on APB1, LPTIM2-5 on APB4; the register/bit pair is per instance.
   */

  regval  = getreg32(clken);
  regval |= clkbit;
  putreg32(regval, clken);

  regval  = getreg32(lpen);
  regval |= lpbit;
  putreg32(regval, lpen);

  spin_unlock_irqrestore(&g_lptim_lock, flags);

  return OK;
}

static int stm32n6_lptim_enableclk(struct stm32n6_lptim_lowerhalf_s *priv)
{
  return stm32n6_lptim_clk_bringup(priv->clken, priv->clkbit,
                                   priv->lpen, priv->lpbit,
                                   priv->selmask, priv->sellsi);
}

/****************************************************************************
 * Name: stm32n6_lptim_write_arr
 *
 * Description:
 *   Program the auto-reload register while the timer is enabled and wait
 *   for the ISR.ARROK handshake, bounded by a timeout so it can never spin
 *   forever.  ARR must only be written with the timer enabled.
 *
 ****************************************************************************/

