open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_lptim.c
static int stm32n6_lptim_write_arr(struct stm32n6_lptim_lowerhalf_s *priv,
                                    uint32_t ticks)
{
  int i;

  /* Clear a stale ARROK, program (ticks - 1), then wait for ARROK */

  putreg32(LPTIM_ICR_ARROKCF, priv->base + STM32_LPTIM_ICR_OFFSET);
  putreg32(ticks - 1, priv->base + STM32_LPTIM_ARR_OFFSET);

  for (i = 0; i < STM32N6_LPTIM_TIMEOUT_US; i++)
    {
      if ((getreg32(priv->base + STM32_LPTIM_ISR_OFFSET) &
           LPTIM_ISR_ARROK) != 0)
        {
          putreg32(LPTIM_ICR_ARROKCF, priv->base + STM32_LPTIM_ICR_OFFSET);
          return OK;
        }

      up_udelay(1);
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: stm32n6_lptim_interrupt
 *
 * Description:
 *   Auto-reload-match interrupt handler.  Acknowledges ARRM and invokes the
 *   registered upper-half callback.  A non-reloading (or NULL) callback
 *   stops the timer.
 *
 ****************************************************************************/

static int stm32n6_lptim_interrupt(int irq, void *context, void *arg)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)arg;
  uint32_t isr;

  DEBUGASSERT(priv != NULL);

  isr = getreg32(priv->base + STM32_LPTIM_ISR_OFFSET);
  if ((isr & LPTIM_ISR_ARRM) == 0)
    {
      return OK;
    }

  /* Acknowledge the auto-reload match */

  putreg32(LPTIM_ICR_ARRMCF, priv->base + STM32_LPTIM_ICR_OFFSET);

  if (priv->callback != NULL)
    {
      uint32_t next = priv->timeout;

      if (priv->callback(&next, priv->arg))
        {
          /* Honour a possibly-updated interval */

          if (next != priv->timeout)
            {
              stm32n6_lptim_settimeout(
                (struct timer_lowerhalf_s *)priv, next);
            }
        }
      else
        {
          stm32n6_lptim_stop((struct timer_lowerhalf_s *)priv);
        }
    }
  else
    {
      stm32n6_lptim_stop((struct timer_lowerhalf_s *)priv);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_lptim_start
 ****************************************************************************/

static int stm32n6_lptim_start(struct timer_lowerhalf_s *lower)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t ticks;
  int ret;

  DEBUGASSERT(priv != NULL);

  if (priv->started)
    {
      return -EBUSY;
    }

  ticks = stm32n6_lptim_timeout_to_ticks(priv->timeout);
  if (ticks == 0)
    {
      return -EINVAL;
    }

  /* Bring up LSI + kernel clock + APB gate before touching any register */

  ret = stm32n6_lptim_enableclk(priv);
  if (ret < 0)
    {
      tmrerr("ERROR: LPTIM LSI clock enable timeout\n");
      return ret;
    }

  flags = spin_lock_irqsave(&g_lptim_lock);

  /* Configuration and interrupt-enable registers may only be written while
   * the timer is disabled.  Use the internal (kernel) clock with the
   * prescaler at divide-by-1 and enable ARR preload for glitch-free
   * updates, then arm the auto-reload-match interrupt.
   */

  putreg32(0, priv->base + STM32_LPTIM_CR_OFFSET);
  putreg32(LPTIM_CFGR_PRELOAD, priv->base + STM32_LPTIM_CFGR_OFFSET);
  putreg32(LPTIM_DIER_ARRMIE, priv->base + STM32_LPTIM_DIER_OFFSET);

  /* Enable the timer; ARR can only be programmed once enabled */

  putreg32(LPTIM_CR_ENABLE, priv->base + STM32_LPTIM_CR_OFFSET);

  ret = stm32n6_lptim_write_arr(priv, ticks);
  if (ret < 0)
    {
      putreg32(0, priv->base + STM32_LPTIM_CR_OFFSET);
      spin_unlock_irqrestore(&g_lptim_lock, flags);
      tmrerr("ERROR: LPTIM ARR update (ARROK) timeout\n");
      return ret;
    }

  /* Drop any pending match flag, then start counting continuously */

  putreg32(LPTIM_ICR_ARRMCF, priv->base + STM32_LPTIM_ICR_OFFSET);
  modifyreg32(priv->base + STM32_LPTIM_CR_OFFSET, 0, LPTIM_CR_CNTSTRT);

  priv->started = true;

  spin_unlock_irqrestore(&g_lptim_lock, flags);

  up_enable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_lptim_stop
 ****************************************************************************/

static int stm32n6_lptim_stop(struct timer_lowerhalf_s *lower)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  if (!priv->started)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&g_lptim_lock);

  /* Clearing ENABLE stops and resets the counter.  Disable the interrupt
   * (writable now that the timer is disabled) and drop any pending flag.
   */

  putreg32(0, priv->base + STM32_LPTIM_CR_OFFSET);
  putreg32(0, priv->base + STM32_LPTIM_DIER_OFFSET);
  putreg32(LPTIM_ICR_ARRMCF, priv->base + STM32_LPTIM_ICR_OFFSET);

  priv->started = false;

  spin_unlock_irqrestore(&g_lptim_lock, flags);

  up_disable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_lptim_getstatus
 ****************************************************************************/

static int stm32n6_lptim_getstatus(struct timer_lowerhalf_s *lower,
                                    struct timer_status_s *status)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)lower;
  uint32_t arr;
  uint32_t cnt;
  uint32_t left;

  DEBUGASSERT(priv != NULL && status != NULL);

  status->flags = 0;
  if (priv->started)
    {
      status->flags |= TCFLAGS_ACTIVE;
    }

  if (priv->callback != NULL)
    {
      status->flags |= TCFLAGS_HANDLER;
    }

  status->timeout = priv->timeout;

  /* Convert the remaining ticks back to microseconds (1 tick = LSI period) */

  arr  = getreg32(priv->base + STM32_LPTIM_ARR_OFFSET) & 0xffff;
  cnt  = stm32n6_lptim_readcnt(priv);
  left = (arr >= cnt) ? (arr - cnt) : 0;

  status->timeleft =
    (uint32_t)(((uint64_t)left * 1000000ull) / STM32N6_LPTIM_LSI_FREQ);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_lptim_settimeout
 ****************************************************************************/

static int stm32n6_lptim_settimeout(struct timer_lowerhalf_s *lower,
                                     uint32_t timeout)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t ticks;
  int ret = OK;

  DEBUGASSERT(priv != NULL);

  ticks = stm32n6_lptim_timeout_to_ticks(timeout);
  if (ticks == 0)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&g_lptim_lock);

  priv->timeout = timeout;

