open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_lptim.c
  /* If the timer is already running, reprogram the auto-reload live (the
   * PRELOAD bit defers it to the next period).  Otherwise start() applies
   * the reload once the timer is enabled.
   */

  if (priv->started)
    {
      ret = stm32n6_lptim_write_arr(priv, ticks);
    }

  spin_unlock_irqrestore(&g_lptim_lock, flags);

  return ret;
}

/****************************************************************************
 * Name: stm32n6_lptim_setcallback
 ****************************************************************************/

static void stm32n6_lptim_setcallback(struct timer_lowerhalf_s *lower,
                                       tccb_t callback, void *arg)
{
  struct stm32n6_lptim_lowerhalf_s *priv =
    (struct stm32n6_lptim_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  flags = spin_lock_irqsave(&g_lptim_lock);
  priv->callback = callback;
  priv->arg      = arg;
  spin_unlock_irqrestore(&g_lptim_lock, flags);
}

/****************************************************************************
 * Name: stm32n6_lptim_maxtimeout
 ****************************************************************************/

static int stm32n6_lptim_maxtimeout(struct timer_lowerhalf_s *lower,
                                    uint32_t *maxtimeout)
{
  UNUSED(lower);
  DEBUGASSERT(maxtimeout != NULL);

  *maxtimeout = (uint32_t)STM32N6_LPTIM_MAXTIMEOUT;
  return OK;
}

#ifdef CONFIG_STM32_LPTIM2_PWM

/****************************************************************************
 * Name: stm32n6_lppwm_write_reg16
 *
 * Description:
 *   Write a 16-bit ARR or CCR1 value while the timer is enabled and wait
 *   for its update-OK handshake flag (ARROK for ARR, CMP1OK for CCR1),
 *   bounded by a timeout so it can never spin forever.  These flags only
 *   assert when the peripheral clock is running and the write has
 *   propagated across the LSI domain, so a PASS is real-hardware evidence
 *   the register took effect.
 *
 ****************************************************************************/

static int stm32n6_lppwm_write_reg16(struct stm32n6_lptim_pwm_s *priv,
                                     uint32_t offset, uint32_t value,
                                     uint32_t okflag, uint32_t okclr)
{
  int i;

  putreg32(okclr, priv->base + STM32_LPTIM_ICR_OFFSET);
  putreg32(value, priv->base + offset);

  for (i = 0; i < STM32N6_LPTIM_TIMEOUT_US; i++)
    {
      if ((getreg32(priv->base + STM32_LPTIM_ISR_OFFSET) & okflag) != 0)
        {
          putreg32(okclr, priv->base + STM32_LPTIM_ICR_OFFSET);
          return OK;
        }

      up_udelay(1);
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: stm32n6_lppwm_setup
 *
 * Description:
 *   Bring up LPTIM2's LSI kernel clock + APB4 gate and route the CH1 output
 *   pin.  Called when /dev/pwm0 is opened; no pulses are emitted yet.
 *
 ****************************************************************************/

static int stm32n6_lppwm_setup(struct pwm_lowerhalf_s *dev)
{
  struct stm32n6_lptim_pwm_s *priv = (struct stm32n6_lptim_pwm_s *)dev;
  int ret;

  DEBUGASSERT(priv != NULL);

  ret = stm32n6_lptim_clk_bringup(priv->clken, priv->clkbit,
                                  priv->lpen, priv->lpbit,
                                  priv->selmask, priv->sellsi);
  if (ret < 0)
    {
      pwmerr("ERROR: LPTIM2 LSI clock enable timeout\n");
      return ret;
    }

  stm32n6_configgpio(priv->pin);
  return OK;
}

/****************************************************************************
 * Name: stm32n6_lppwm_shutdown
 ****************************************************************************/

static int stm32n6_lppwm_shutdown(struct pwm_lowerhalf_s *dev)
{
  struct stm32n6_lptim_pwm_s *priv = (struct stm32n6_lptim_pwm_s *)dev;

  DEBUGASSERT(priv != NULL);

  stm32n6_lppwm_stop(dev);
  stm32n6_unconfiggpio(priv->pin);
  return OK;
}

/****************************************************************************
 * Name: stm32n6_lppwm_start
 *
 * Description:
 *   Program the requested frequency + duty and start the continuous PWM.
 *   Register order follows ST's HAL: configure while disabled, enable, write
 *   ARR (poll ARROK) then CCR1 (poll CMP1OK), enable the CH1 output, then
 *   start continuous counting.  For LPTIM2 the output polarity lives in
 *   CCMR1.CC1P (LPTIM4/5 would use CFGR.WAVPOL instead).
 *
 ****************************************************************************/

static int stm32n6_lppwm_start(struct pwm_lowerhalf_s *dev,
                               const struct pwm_info_s *info)
{
  struct stm32n6_lptim_pwm_s *priv = (struct stm32n6_lptim_pwm_s *)dev;
  irqstate_t flags;
  uint32_t arr;
  uint32_t ccr;
  int ret;

  DEBUGASSERT(priv != NULL && info != NULL);

  /* 16-bit counter at the divide-by-1 LSI tick: ARR = LSI/freq - 1 must land
   * in [1, 0xffff], so the frequency must be within (LSI/65536, LSI/2].
   */

  if (info->frequency == 0 ||
      info->frequency > (STM32N6_LPTIM_LSI_FREQ / 2))
    {
      return -EINVAL;
    }

  arr = (STM32N6_LPTIM_LSI_FREQ / info->frequency);
  if (arr < 2 || arr > (STM32N6_LPTIM_MAXTICKS))
    {
      return -EINVAL;
    }

  arr -= 1;

  /* Duty is a b16 fraction of the full period (65536 == 100%).  CCR1 sets
   * the compare point within [0, ARR]; clamp so 100% stays in range.
   */

  ccr = (uint32_t)(((uint64_t)(arr + 1) * info->duty) >> 16);
  if (ccr > arr)
    {
      ccr = arr;
    }

  flags = spin_lock_irqsave(&g_lptim_lock);

  /* CFGR / CCMR1 polarity are writable only while disabled.  Internal
   * clock, prescaler divide-by-1, ARR preload, PWM waveform (WAVE = 0).
   * No interrupt is needed: the hardware drives the CH1 waveform on its own.
   */

  putreg32(0, priv->base + STM32_LPTIM_CR_OFFSET);
  putreg32(LPTIM_CFGR_PRELOAD, priv->base + STM32_LPTIM_CFGR_OFFSET);
  putreg32(0, priv->base + STM32_LPTIM_CCMR1_OFFSET);

  /* Enable; ARR and CCR1 can only be programmed once the timer is enabled */

  putreg32(LPTIM_CR_ENABLE, priv->base + STM32_LPTIM_CR_OFFSET);

  ret = stm32n6_lppwm_write_reg16(priv, STM32_LPTIM_ARR_OFFSET, arr,
                                  LPTIM_ISR_ARROK, LPTIM_ICR_ARROKCF);
  if (ret < 0)
    {
      goto err;
    }

  ret = stm32n6_lppwm_write_reg16(priv, STM32_LPTIM_CCR1_OFFSET, ccr,
                                  LPTIM_ISR_CMP1OK, LPTIM_ICR_CMP1OKCF);
  if (ret < 0)
    {
      goto err;
    }

  /* Enable the CH1 compare output (CC1SEL = 0 keeps it an output) and start
   * counting continuously.  Clear any stale match before arming the counter.
   */

  modifyreg32(priv->base + STM32_LPTIM_CCMR1_OFFSET, 0, LPTIM_CCMR1_CC1E);
  modifyreg32(priv->base + STM32_LPTIM_CR_OFFSET, 0, LPTIM_CR_CNTSTRT);

  spin_unlock_irqrestore(&g_lptim_lock, flags);
  return OK;

err:
  putreg32(0, priv->base + STM32_LPTIM_CR_OFFSET);
  spin_unlock_irqrestore(&g_lptim_lock, flags);
  pwmerr("ERROR: LPTIM2 PWM update handshake timeout\n");
  return ret;
}

/****************************************************************************
 * Name: stm32n6_lppwm_stop
 ****************************************************************************/

static int stm32n6_lppwm_stop(struct pwm_lowerhalf_s *dev)
{
  struct stm32n6_lptim_pwm_s *priv = (struct stm32n6_lptim_pwm_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  flags = spin_lock_irqsave(&g_lptim_lock);

