open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_lptim.c
  if (elapsed != NULL)
    {
      *elapsed = (after >= before) ? (after - before) : 0;
    }

  /* PASS requires both hardware witnesses: Stop was truly entered (STOPF)
   * and LPTIM3 is what woke the core (ISR ran).
   */

  if (!entered || !g_lptim_stopwake_woke)
    {
      return -EIO;
    }

  return OK;
}

#endif /* CONFIG_STM32_LPTIM_STOPWAKE */

/****************************************************************************
 * Name: stm32n6_lptim_initialize
 *
 * Description:
 *   Bind a low-power timer to a character device and register it.
 *
 * Input Parameters:
 *   devpath - Character device path (e.g. "/dev/timer1").
 *   timer   - LPTIM peripheral number (1 on APB1; 2-5 on APB4).
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

int stm32n6_lptim_initialize(const char *devpath, int timer)
{
  struct stm32n6_lptim_lowerhalf_s *priv;
  void *handle;

  DEBUGASSERT(devpath != NULL);

  switch (timer)
    {
#ifdef CONFIG_STM32_LPTIM1
      case 1:
        priv = &g_lptim1_lowerhalf;
        break;
#endif

#ifdef CONFIG_STM32_LPTIM2
      case 2:
        priv = &g_lptim2_lowerhalf;
        break;
#endif

#ifdef CONFIG_STM32_LPTIM3
      case 3:
        priv = &g_lptim3_lowerhalf;
        break;
#endif

#ifdef CONFIG_STM32_LPTIM4
      case 4:
        priv = &g_lptim4_lowerhalf;
        break;
#endif

#ifdef CONFIG_STM32_LPTIM5
      case 5:
        priv = &g_lptim5_lowerhalf;
        break;
#endif

      default:
        return -ENODEV;
    }

  /* Attach the match ISR (kept disabled at the NVIC until start) */

  irq_attach(priv->irq, stm32n6_lptim_interrupt, priv);

  handle = timer_register(devpath, (struct timer_lowerhalf_s *)priv);
  if (handle == NULL)
    {
      irq_detach(priv->irq);
      return -EEXIST;
    }

  return OK;
}

#ifdef CONFIG_STM32_LPTIM2_PWM

/****************************************************************************
 * Name: stm32n6_lppwm_initialize
 *
 * Description:
 *   Register LPTIM2 as a PWM character device driving LPTIM2_CH1 from LSI.
 *
 ****************************************************************************/

int stm32n6_lppwm_initialize(const char *devpath)
{
  struct stm32n6_lptim_pwm_s *priv = &g_lptim2_pwm;

  DEBUGASSERT(devpath != NULL);

  /* The hardware drives the CH1 waveform autonomously; no IRQ is attached */

  return pwm_register(devpath, (struct pwm_lowerhalf_s *)priv);
}
#endif /* CONFIG_STM32_LPTIM2_PWM */
